testplan/outbox-eventual-consistency.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="outbox-eventual-consistency" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE" elementType="Argument">
            <stringProp name="Argument.name">BASE</stringProp>
            <stringProp name="Argument.value">https://127.0.0.1:6655</stringProp>
          </elementProp>
          <elementProp name="TOKEN" elementType="Argument">
            <stringProp name="Argument.name">TOKEN</stringProp>
            <stringProp name="Argument.value">REPLACE_WITH_JWT</stringProp>
          </elementProp>
          <elementProp name="SKU_ID" elementType="Argument">
            <stringProp name="Argument.name">SKU_ID</stringProp>
            <stringProp name="Argument.value">REPLACE_WITH_SKU_ID</stringProp>
          </elementProp>
          <elementProp name="TRADE_JDBC" elementType="Argument">
            <stringProp name="Argument.name">TRADE_JDBC</stringProp>
            <stringProp name="Argument.value">jdbc:postgresql://127.0.0.1:5434/shopping_trade</stringProp>
          </elementProp>
          <elementProp name="PRODUCT_JDBC" elementType="Argument">
            <stringProp name="Argument.name">PRODUCT_JDBC</stringProp>
            <stringProp name="Argument.value">jdbc:postgresql://127.0.0.1:5435/shopping_product</stringProp>
          </elementProp>
          <elementProp name="CORE_JDBC" elementType="Argument">
            <stringProp name="Argument.name">CORE_JDBC</stringProp>
            <stringProp name="Argument.value">jdbc:postgresql://127.0.0.1:5433/shopping_core</stringProp>
          </elementProp>
          <elementProp name="RISK_JDBC" elementType="Argument">
            <stringProp name="Argument.name">RISK_JDBC</stringProp>
            <stringProp name="Argument.value">jdbc:postgresql://127.0.0.1:5437/shopping_risk</stringProp>
          </elementProp>
          <elementProp name="DB_USER" elementType="Argument">
            <stringProp name="Argument.name">DB_USER</stringProp>
            <stringProp name="Argument.value">postgres</stringProp>
          </elementProp>
          <elementProp name="DB_PASS" elementType="Argument">
            <stringProp name="Argument.name">DB_PASS</stringProp>
            <stringProp name="Argument.value">123456</stringProp>
          </elementProp>
          <elementProp name="FAULT_USER_ID" elementType="Argument">
            <stringProp name="Argument.name">FAULT_USER_ID</stringProp>
            <stringProp name="Argument.value">REPLACE_WITH_USER_ID</stringProp>
          </elementProp>
          <elementProp name="REDIS_HOST" elementType="Argument">
            <stringProp name="Argument.name">REDIS_HOST</stringProp>
            <stringProp name="Argument.value">127.0.0.1</stringProp>
          </elementProp>
          <elementProp name="REDIS_PORT" elementType="Argument">
            <stringProp name="Argument.name">REDIS_PORT</stringProp>
            <stringProp name="Argument.value">6380</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ===== JDBC Connection Configs ===== -->
      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC-TRADE" enabled="true">
        <stringProp name="dataSource">poolTrade</stringProp>
        <stringProp name="dbUrl">${TRADE_JDBC}</stringProp>
        <stringProp name="username">${DB_USER}</stringProp>
        <stringProp name="password">${DB_PASS}</stringProp>
        <stringProp name="driverClass">org.postgresql.Driver</stringProp>
        <intProp name="poolMax">10</intProp>
        <boolProp name="autocommit">true</boolProp>
      </JDBCDataSource>
      <hashTree/>

      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC-PRODUCT" enabled="true">
        <stringProp name="dataSource">poolProduct</stringProp>
        <stringProp name="dbUrl">${PRODUCT_JDBC}</stringProp>
        <stringProp name="username">${DB_USER}</stringProp>
        <stringProp name="password">${DB_PASS}</stringProp>
        <stringProp name="driverClass">org.postgresql.Driver</stringProp>
        <intProp name="poolMax">10</intProp>
        <boolProp name="autocommit">true</boolProp>
      </JDBCDataSource>
      <hashTree/>

      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC-CORE" enabled="true">
        <stringProp name="dataSource">poolCore</stringProp>
        <stringProp name="dbUrl">${CORE_JDBC}</stringProp>
        <stringProp name="username">${DB_USER}</stringProp>
        <stringProp name="password">${DB_PASS}</stringProp>
        <stringProp name="driverClass">org.postgresql.Driver</stringProp>
        <intProp name="poolMax">10</intProp>
        <boolProp name="autocommit">true</boolProp>
      </JDBCDataSource>
      <hashTree/>

      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC-RISK" enabled="true">
        <stringProp name="dataSource">poolRisk</stringProp>
        <stringProp name="dbUrl">${RISK_JDBC}</stringProp>
        <stringProp name="username">${DB_USER}</stringProp>
        <stringProp name="password">${DB_PASS}</stringProp>
        <stringProp name="driverClass">org.postgresql.Driver</stringProp>
        <intProp name="poolMax">10</intProp>
        <boolProp name="autocommit">true</boolProp>
      </JDBCDataSource>
      <hashTree/>

      <!-- ===== Global Header Manager ===== -->
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Global Headers" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer ${TOKEN}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>

      <!-- ===== Thread Group A: Order Create Saga (TRADE->PRODUCT->TRADE) ===== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="A: order-create-saga" enabled="true">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">20</intProp>
        <intProp name="ThreadGroup.num_loops">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST create order" enabled="true">
          <stringProp name="HTTPSampler.path">${BASE}/shopping/user/api/orders</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{"skuId":"${SKU_ID}","quantity":1,"idempotencyKey":"${__UUID()}"}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor" testname="Extract orderNo" enabled="true">
            <stringProp name="JSONPathExtractor.referenceNames">ORDER_NO</stringProp>
            <stringProp name="JSONPathExtractor.jsonPathExprs">$.data.orderNo</stringProp>
            <stringProp name="JSONPathExtractor.defaultValues">NOT_FOUND</stringProp>
          </JSONPathExtractor>
          <JSONPathExtractor guiclass="JSONPathExtractorGui" testclass="JSONPathExtractor" testname="Extract initial status" enabled="true">
            <stringProp name="JSONPathExtractor.referenceNames">INITIAL_STATUS</stringProp>
            <stringProp name="JSONPathExtractor.jsonPathExprs">$.data.status</stringProp>
            <stringProp name="JSONPathExtractor.defaultValues">UNKNOWN</stringProp>
          </JSONPathExtractor>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert ORDER_CREATE_OK" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">ORDER_CREATE_OK</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <!-- Poll TRADE DB until status leaves STOCK_CONFIRMING (max 8s) -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Poll TRADE: status convergence" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
import groovy.sql.Sql
def orderNo = vars.get("ORDER_NO")
if (!orderNo || orderNo == "NOT_FOUND") { return }
def sql = Sql.newInstance(vars.get("TRADE_JDBC"), vars.get("DB_USER"), vars.get("DB_PASS"), "org.postgresql.Driver")
try {
    def finalStatus = null
    def deadline = System.currentTimeMillis() + 8000
    while (System.currentTimeMillis() &lt; deadline) {
        def row = sql.firstRow("SELECT status FROM trade_order WHERE order_no = ?", [orderNo])
        if (row) {
            finalStatus = row.status
            if (finalStatus != "STOCK_CONFIRMING") break
        }
        Thread.sleep(500)
    }
    vars.put("FINAL_ORDER_STATUS", finalStatus ?: "NULL")
    if (finalStatus == "STOCK_CONFIRMING" || finalStatus == null) {
        AssertionResult result = new AssertionResult("status-convergence")
        result.setFailure(true)
        result.setFailureMessage("Order stuck in STOCK_CONFIRMING after 8s: " + orderNo)
        prev.addAssertionResult(result)
    }
} finally { sql.close() }
            </stringProp>
          </JSR223PostProcessor>
          <!-- Assert source (TRADE) not rolled back -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Assert TRADE: source not rolled back" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
import groovy.sql.Sql
def orderNo = vars.get("ORDER_NO")
if (!orderNo || orderNo == "NOT_FOUND") { return }
def sql = Sql.newInstance(vars.get("TRADE_JDBC"), vars.get("DB_USER"), vars.get("DB_PASS"), "org.postgresql.Driver")
try {
    def row = sql.firstRow("SELECT count(*) AS cnt FROM trade_order WHERE order_no = ?", [orderNo])
    if (!row || row.cnt == 0) {
        AssertionResult result = new AssertionResult("source-not-rolled-back")
        result.setFailure(true)
        result.setFailureMessage("Source order was incorrectly rolled back: " + orderNo)
        prev.addAssertionResult(result)
    }
} finally { sql.close() }
            </stringProp>
          </JSR223PostProcessor>
        </hashTree>
      </hashTree>

      <!-- ===== Thread Group B: Order Cancel (TRADE->PRODUCT) ===== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="B: order-cancel" enabled="true">
        <intProp name="ThreadGroup.num_threads">20</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <intProp name="ThreadGroup.num_loops">3</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST cancel order" enabled="true">
          <stringProp name="HTTPSampler.path">${BASE}/shopping/user/api/orders/${ORDER_NO}/cancel</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert ORDER_CANCEL_OK" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">ORDER_CANCEL_OK</stringProp>
            </collectionProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <!-- Poll TRADE: cancelled -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Poll TRADE: CANCELLED" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
import groovy.sql.Sql
def orderNo = vars.get("ORDER_NO")
if (!orderNo || orderNo == "NOT_FOUND") { return }
def sql = Sql.newInstance(vars.get("TRADE_JDBC"), vars.get("DB_USER"), vars.get("DB_PASS"), "org.postgresql.Driver")
try {
    def row = sql.firstRow("SELECT status FROM trade_order WHERE order_no = ?", [orderNo])
    if (!row || row.status != "CANCELLED") {
        AssertionResult result = new AssertionResult("cancel-trade-status")
        result.setFailure(true)
        result.setFailureMessage("Order not CANCELLED in TRADE: " + orderNo + " status=" + (row?.status ?: "NULL"))
        prev.addAssertionResult(result)
    }
} finally { sql.close() }
            </stringProp>
          </JSR223PostProcessor>
          <!-- Poll PRODUCT: outbox event exists -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Assert PRODUCT: outbox event exists" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
import groovy.sql.Sql
def orderNo = vars.get("ORDER_NO")
if (!orderNo || orderNo == "NOT_FOUND") { return }
def eventId = "order-inventory-release:" + orderNo + ":CANCEL"
def sql = Sql.newInstance(vars.get("TRADE_JDBC"), vars.get("DB_USER"), vars.get("DB_PASS"), "org.postgresql.Driver")
try {
    def row = sql.firstRow("SELECT status FROM outbox_event WHERE event_id = ?", [eventId])
    if (!row) {
        AssertionResult result = new AssertionResult("outbox-event-exists")
        result.setFailure(true)
        result.setFailureMessage("Outbox event not found for cancel: " + eventId)
        prev.addAssertionResult(result)
    }
} finally { sql.close() }
            </stringProp>
          </JSR223PostProcessor>
        </hashTree>
      </hashTree>

      <!-- ===== Thread Group C: Idempotency check ===== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="C: idempotency-check" enabled="true">
        <intProp name="ThreadGroup.num_threads">5</intProp>
        <intProp name="ThreadGroup.ramp_time">2</intProp>
        <intProp name="ThreadGroup.num_loops">1</intProp>
      </ThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Assert inbox_event idempotency" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
import groovy.sql.Sql
def orderNo = vars.get("ORDER_NO")
if (!orderNo || orderNo == "NOT_FOUND") {
    SampleResult.setSuccessful(true); SampleResult.setResponseMessage("no orderNo skipped"); return
}
def eventId = "order-stock-deduct-requested:" + orderNo
def sql = Sql.newInstance(vars.get("PRODUCT_JDBC"), vars.get("DB_USER"), vars.get("DB_PASS"), "org.postgresql.Driver")
try {
    def row = sql.firstRow("SELECT count(*) AS cnt FROM inbox_event WHERE event_id = ? AND consumer_name = 'order-stock-deduct-product'", [eventId])
    long cnt = row?.cnt ?: 0
    if (cnt > 1) {
        SampleResult.setSuccessful(false)
        SampleResult.setResponseMessage("inbox_event processed more than once: count=" + cnt + " event=" + eventId)
    } else {
        SampleResult.setSuccessful(true)
        SampleResult.setResponseMessage("idempotency ok: count=" + cnt)
    }
} finally { sql.close() }
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

      <!-- ===== Thread Group D: Auth Risk Lock (Redis seed + assert) ===== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="D: auth-risk-lock" enabled="true">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <intProp name="ThreadGroup.num_loops">1</intProp>
      </ThreadGroup>
      <hashTree>
        <!-- Step 1: Seed Redis failure counters to threshold to trigger lock -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Seed Redis auth failure counters" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
// Requires Jedis on JMeter classpath: drop jedis-*.jar into $JMETER_HOME/lib/
import redis.clients.jedis.Jedis
def userId = vars.get("FAULT_USER_ID")
def host = vars.get("REDIS_HOST")
def port = vars.get("REDIS_PORT").toInteger()
def jedis = new Jedis(host, port)
try {
    // Keys matching UserAuthRiskRedisKeys patterns
    def totalKey = "auth:fail:total:30m:" + userId
    def pwdKey   = "auth:fail:pwd:30m:" + userId
    jedis.set(totalKey, "15")
    jedis.expire(totalKey, 1800)
    jedis.set(pwdKey, "8")
    jedis.expire(pwdKey, 1800)
    SampleResult.setSuccessful(true)
    SampleResult.setResponseMessage("Redis failure counters seeded for userId=" + userId)
} finally { jedis.close() }
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
        <!-- Step 2: Poll RISK DB for lock record (written by AuthLockRiskWriter) -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Poll RISK: lock state written" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
import groovy.sql.Sql
def userId = vars.get("FAULT_USER_ID").toLong()
def sql = Sql.newInstance(vars.get("RISK_JDBC"), vars.get("DB_USER"), vars.get("DB_PASS"), "org.postgresql.Driver")
try {
    def deadline = System.currentTimeMillis() + 5000
    def found = false
    while (System.currentTimeMillis() &lt; deadline) {
        def row = sql.firstRow("SELECT lock_count FROM user_risk_profile WHERE user_id = ?", [userId])
        if (row && row.lock_count > 0) { found = true; break }
        Thread.sleep(500)
    }
    SampleResult.setSuccessful(found)
    SampleResult.setResponseMessage(found ? "RISK lock state found" : "RISK lock state NOT found after 5s")
} finally { sql.close() }
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
        <!-- Step 3: Poll CORE DB for status=LOCKED (via AccountStatusSyncConsumer) -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Poll CORE: status=LOCKED (eventual)" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
import groovy.sql.Sql
def userId = vars.get("FAULT_USER_ID").toLong()
def sql = Sql.newInstance(vars.get("CORE_JDBC"), vars.get("DB_USER"), vars.get("DB_PASS"), "org.postgresql.Driver")
try {
    def deadline = System.currentTimeMillis() + 10000
    def finalStatus = null
    while (System.currentTimeMillis() &lt; deadline) {
        def row = sql.firstRow("SELECT status FROM user_login_identity WHERE user_id = ?", [userId])
        if (row) { finalStatus = row.status; if (finalStatus == "LOCKED") break }
        Thread.sleep(500)
    }
    SampleResult.setSuccessful(finalStatus == "LOCKED")
    SampleResult.setResponseMessage("CORE status=" + finalStatus)
} finally { sql.close() }
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
        <!-- Step 4: Assert inbox_event idempotency in CORE -->
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Assert CORE inbox idempotency" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
import groovy.sql.Sql
def userId = vars.get("FAULT_USER_ID")
def sql = Sql.newInstance(vars.get("CORE_JDBC"), vars.get("DB_USER"), vars.get("DB_PASS"), "org.postgresql.Driver")
try {
    def row = sql.firstRow("SELECT count(*) AS cnt FROM inbox_event WHERE consumer_name = 'account-status-sync-core' AND event_id LIKE 'acct-status-' || ? || '-%'", [userId])
    long cnt = row?.cnt ?: 0
    SampleResult.setSuccessful(cnt == 1)
    SampleResult.setResponseMessage("CORE inbox_event count for userId=" + userId + ": " + cnt + " (expected 1)")
} finally { sql.close() }
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

      <!-- ===== Summary Report ===== -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">testplan/results.jtl</stringProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>